In [1]:
import pandas as pd

In [17]:
dict1={'Name': ['John Fogerty', 'Elvis Presley', 'Bob Dylan', \
                'Johnny Cash'],
        'City': ['New York', 'Los Angeles',' Chicago  ','Houston'],
        'State': ['NY','CA','IL','TX'],
        }
df=pd.DataFrame(dict1)
df

            Name         City State
0   John Fogerty     New York    NY
1  Elvis Presley  Los Angeles    CA
2      Bob Dylan    Chicago      IL
3    Johnny Cash      Houston    TX

In [10]:
name_lower=df['Name'].str.lower()
name_lower

0     john fogerty
1    elvis presley
2        bob dylan
3      johnny cash
Name: Name, dtype: object

In [11]:
name_upper=df['Name'].str.upper()
name_upper

0     JOHN FOGERTY
1    ELVIS PRESLEY
2        BOB DYLAN
3      JOHNNY CASH
Name: Name, dtype: object

In [18]:
length=df['City'].str.len()
length

0     8
1    11
2    10
3     7
Name: City, dtype: int64

In [16]:
df['City'][2]

' Chicago  '

In [20]:
#remove spaces from particular row in the series
df['City'][2].strip()

'Chicago'

In [21]:
#remove spaces from each value in Series
df['City'].str.strip()

0       New York
1    Los Angeles
2        Chicago
3        Houston
Name: City, dtype: object

In [23]:
#using split and adding 2 new columns to DataFrame
df[['First','Last']]=df['Name'].str.split(' ',expand=True)

In [24]:
df

            Name         City State   First     Last
0   John Fogerty     New York    NY    John  Fogerty
1  Elvis Presley  Los Angeles    CA   Elvis  Presley
2      Bob Dylan    Chicago      IL     Bob    Dylan
3    Johnny Cash      Houston    TX  Johnny     Cash

In [25]:
df['Name'].str.contains('John')

0     True
1    False
2    False
3     True
Name: Name, dtype: bool

In [26]:
#get  particular row(s) using Boolean indexing
df[df['Name'].str.contains('John')]

           Name      City State   First     Last
0  John Fogerty  New York    NY    John  Fogerty
3   Johnny Cash   Houston    TX  Johnny     Cash

In [27]:
df['State'].str.replace('NY','New York')

0    New York
1          CA
2          IL
3          TX
Name: State, dtype: object

In [28]:
df['State'].str.replace('CA','California').str.replace('TX','Texas')

0            NY
1    California
2            IL
3         Texas
Name: State, dtype: object

In [29]:
df['Name'].str.startswith('Joh')

0     True
1    False
2    False
3     True
Name: Name, dtype: bool

In [30]:
df[df['Name'].str.endswith('y')]

            Name         City State  First     Last
0   John Fogerty     New York    NY   John  Fogerty
1  Elvis Presley  Los Angeles    CA  Elvis  Presley

In [31]:
df['First'].str.cat(df['Last'],'-')

0     John-Fogerty
1    Elvis-Presley
2        Bob-Dylan
3      Johnny-Cash
Name: First, dtype: object

In [32]:
df['Name'].str.get(0)

0    J
1    E
2    B
3    J
Name: Name, dtype: object

In [33]:
df['Name'].str.get(-1) #last character

0    y
1    y
2    n
3    h
Name: Name, dtype: object

In [35]:
#extract first string from the list
df['Name'].str.split().str.get(0)

0      John
1     Elvis
2       Bob
3    Johnny
Name: Name, dtype: object

In [36]:
#Extract the first 3 characters
df['Name'].str.slice(0,3)

0    Joh
1    Elv
2    Bob
3    Joh
Name: Name, dtype: object

In [37]:
#Extract the last 3 characters
df['Name'].str.slice(-3)

0    rty
1    ley
2    lan
3    ash
Name: Name, dtype: object

In [38]:
#Concatenation
df['Name'].str.slice(0,3) + ': ' + df['State']

0    Joh: NY
1    Elv: CA
2    Bob: IL
3    Joh: TX
dtype: object

In [43]:
df['Name']

0     John Fogerty
1    Elvis Presley
2        Bob Dylan
3      Johnny Cash
Name: Name, dtype: object

In [42]:
df['Name'].str.find('h')

0    2
1   -1
2   -1
3    2
Name: Name, dtype: int64

In [40]:
df['Name'].str.rfind('h')

0     2
1    -1
2    -1
3    10
Name: Name, dtype: int64